app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`) VALUES ('fdvdf', 'vdfvd', '2022-07-29 17:30:17', '2022-07-29 17:30:17')
---
  def create
    # render plain: params.inspect
    @article = Article.new(article_params)


    if (@article.save)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def show
      # render plain: params[:article].inspect
    @article = Article.find(params[:id])

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1
UPDATE `articles` SET `title` = 'vdfvdfd', `description` = 'ddddsdss', `updated_at` = '2022-07-29 17:34:39' WHERE `articles`.`id` = 1
---
  def update
        # render plain: params[:article].inspect
    @article=Article.find params[:id]
        if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
  def destroy
    @article = Article.find(params[:id])
    if (@article.destroy)